
#   /V\    
#  / V \
# / V V \  
#/VV V VV\ 

#print("    /V\    ")
#print("   / V \    ")
#print("  / V V \    ")
#print(" /VV V VV\    ")


#n=input("Сколько ёлок вы хотите вывести на экран (1-9): ")
#n=int(n)
#while n>10:
#    try:
#        print("Введите число от 1 до 9!!!")
#    except ValueError:
#        print("Введите число от 1 до 9!!!")
#    else:
#        break



#n=input("Сколько ёлок вы хотите вывести на экран (1-9): ")
#n=int(n)
#for i in range(n):
#        print("    /V\    ",end='\n')
#        print("   / V \    ",end='\n')
#        print("  / V V \    ",end='\n')
#        print(" /VV V VV\    ",end='\n')





#2. Перемножить все не чётные значения в диапазоне от 0 до введенного пользователем числа(R);
#R=input("Введите значение (R) до которого будут перемножаться числа: ")
#A=1

#A=int(A)
#R=int(R)

#S1=0
#S2=0

#for i in range(A,R):
#    if i % 2 == 0:
#        S1 += i
#    else:
#        S2 += i
#    i+=1
#    S3=S2*i
#print("Произведение не чётных чисел = ", S3)

#3. Дано N чисел. Найти количество положительных чисел среди них; N рандомное число

        







#5. Найти сумму ряда чисел от A до B. Полученный результат вывести на экран;
#A=input("Введите 1 число:  ")
#B=input("Введите 2 число: ")

#S=0

#A=int(A)
#B=int(B)

#for i in range(A, B):
#    S+=i
#print("Сумма ряда чисел: ", S)
    









